In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
s = Series([4.5,7.2,-5.3,3.6],index=list('dbac'))

In [3]:
s

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [23]:
s['e']=np.nan

In [37]:
s.fillna(0, inplace=True)

TypeError: 'int' object is not callable

In [53]:
s.reindex(fill_value=0)

d    4.5
b    7.2
a   -5.3
c    3.6
e    NaN
dtype: float64

In [17]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [18]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [22]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [31]:
data.iloc[1:3,1:4]=0

In [32]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    0      0     0
Utah        8    0      0     0
New York   12   13     14    15

In [2]:
df1=DataFrame(np.arange(12.).reshape((3,-1)),index=[0,1,2],columns=list('abcd'))

In [3]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [4]:
df2=DataFrame(np.arange(20.).reshape((4,-1)),columns=list('abcde'))

In [5]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [6]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [13]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [14]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [64]:
df1.add(df2).isnull().sum(0)

a    1
b    1
c    1
d    1
e    4
dtype: int64

In [65]:
df1.add(df2).isnull().sum(1)

0    1
1    1
2    1
3    5
dtype: int64

In [67]:
df3=df1.(df2,fill_value=0)

In [70]:
df3

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [72]:
df3[df3>10]

      a     b     c     d     e
0   NaN   NaN   NaN   NaN   NaN
1   NaN  11.0  13.0  15.0   NaN
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [91]:
score=DataFrame([[30,80,50],[40,70,60],[50,50,70]],index=['영희','철수','미진'],columns=['수학','국어','음악'])

In [92]:
score

    수학  국어  음악
영희  30  80  50
철수  40  70  60
미진  50  50  70

In [99]:
type(score.iloc[0,0])

numpy.int64

수학 국어 음악 가중치 1,1.2,2

In [94]:
weight=np.array([1.0,1.2,2.0])

dot연산한 다음 sum

In [105]:
score.values

array([[30, 80, 50],
       [40, 70, 60],
       [50, 50, 70]], dtype=int64)

In [111]:
score.values

array([[30, 80, 50],
       [40, 70, 60],
       [50, 50, 70]], dtype=int64)

In [112]:
np.dot(score.values,weight).sum()

720.0

개인당 점수

In [134]:
sw=np.dot(score.values,weight)

In [135]:
sw=DataFrame(sw,index=['영희','철수','미진'])

In [136]:
sw

        0
영희  226.0
철수  244.0
미진  250.0

In [137]:
sw.rank(ascending=False)

      0
영희  3.0
철수  2.0
미진  1.0